### 1.1 Загрузка данных

In [97]:
# pip show pandas
# pip install pands

In [132]:
### Импорт данных: 
## Данные были собраны с одного из российских сайтов объявлений,
## Регион - вся Россия, любая марка автомобиля, цена 450 000 - 1 млн
## Дата ноябрь 2021 года

import pandas as pd

df = pd.read_csv ('data_raw/car_data_12-19_made_C.csv')
df.head(2)

,car_brand,car_price,car_location,car_details,ad_date,car_dealer,car_description,today,car_url
0,"Mitsubishi Lancer, 2014",650 000 ₽,Москва,"100 181 км, 1.8 CVT (140 л.с.), седан, передни...",Несколько секунд назад,NaN,Прoдаю надёжный автомобиль в достойнойном тeхн...,2021-11-23,https://www.avito.ru//moskva/avtomobili/mitsub...
1,"Mazda 3, 2008",490 000 ₽,"Свердловская область, Екатеринбург","213 000 км, 1.6 MT (105 л.с.), седан, передний...",Несколько секунд назад,NaN,"По кузову имеется один окрас, остальное все в ...",2021-11-23,https://www.avito.ru//ekaterinburg/avtomobili/...

### 1.2 Ознакомление с данными: 
#### head, tail, sample, size, shape, ndim, info, describe

In [133]:
## Мы можем визуально проверять строки нашего фрейма данных с 
## начала, 
df.head (3)

,car_brand,car_price,car_location,car_details,ad_date,car_dealer,car_description,today,car_url
0,"Mitsubishi Lancer, 2014",650 000 ₽,Москва,"100 181 км, 1.8 CVT (140 л.с.), седан, передни...",Несколько секунд назад,NaN,Прoдаю надёжный автомобиль в достойнойном тeхн...,2021-11-23,https://www.avito.ru//moskva/avtomobili/mitsub...
1,"Mazda 3, 2008",490 000 ₽,"Свердловская область, Екатеринбург","213 000 км, 1.6 MT (105 л.с.), седан, передний...",Несколько секунд назад,NaN,"По кузову имеется один окрас, остальное все в ...",2021-11-23,https://www.avito.ru//ekaterinburg/avtomobili/...
2,"ВАЗ (LADA) Granta, 2020",742 000 ₽,"Свердловская область, Екатеринбург","25 600 км, 1.6 MT (106 л.с.), седан, передний,...",Несколько секунд назад,ИЮЛЬ авто с пробегом,= Самый большой Автомолл! Более 700 автомобиле...,2021-11-23,https://www.avito.ru//ekaterinburg/avtomobili/...

In [134]:
## с хвоста
df.car_brand.tail (3)

5653        Skoda Rapid, 2018
5654    ВАЗ (LADA) XRAY, 2019
5655        УАЗ Patriot, 2016
Name: car_brand, dtype: object

In [136]:
## или можем выбрать просмотр случайно выбранных строк.
df.sample(n=5)

,car_brand,car_price,car_location,car_details,ad_date,car_dealer,car_description,today,car_url
4618,"Audi A5, 2010",800 000 ₽,"Еврейская автономная область, Биробиджан","133 330 км, 2.0 CVT (180 л.с.), хетчбэк, перед...",2 часа назад,NaN,Торг при осмотре.,2021-11-23,https://www.avito.ru//birobidzhan/avtomobili/a...
4066,"Toyota Auris, 2007",510 000 ₽,"Пермский край, Пермь","206 000 км, 1.6 AMT (124 л.с.), хетчбэк, перед...",3 часа назад,MY CAR -- комфортный салон автомобилей с пробегом,"Toyota Corolla 2007 года.\n\nПтс оригинал, фак...",2021-11-23,https://www.avito.ru//perm/avtomobili/toyota_a...
2270,"Volkswagen Tiguan, 2010",840 000 ₽,"Калужская область, Калуга","178 005 км, 1.4 MT (150 л.с.), внедорожник, по...",2 часа назад,МАРКАВТО,Маркавто — салон подержанных автомобилей.\n\nМ...,2021-11-23,https://www.avito.ru//kaluga/avtomobili/volksw...
1837,"Mazda 6, 2008",575 000 ₽,Москва,"236 898 км, 2.0 MT (140 л.с.), универсал, пере...",1 час назад,NaN,Продам Универсал Mazda 6 2008г. 2 Литра Дизель...,2021-11-23,https://www.avito.ru//moskva/avtomobili/mazda_...
1650,"SsangYong Actyon, 2007",550 000 ₽,"Нижегородская область, Павловский муниципальны...","228 000 км, 2.3 AT (150 л.с.), внедорожник, по...",1 час назад,NaN,В одних руках с 2008 года. Очень ухожен. Косме...,2021-11-23,https://www.avito.ru//nizhegorodskaya_oblast_p...

In [137]:
## Давайте теперь рассмотрим некоторую базовую статистику о данных
df.size, df.shape, df.ndim

(50904, (5656, 9), 2)

In [138]:
##info () дает более детальный вид и объединяет информацию о форме и размере.
df.info ()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5656 entries, 0 to 5655
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   car_brand        5656 non-null   object
 1   car_price        5656 non-null   object
 2   car_location     5656 non-null   object
 3   car_details      5656 non-null   object
 4   ad_date          5656 non-null   object
 5   car_dealer       1663 non-null   object
 6   car_description  5047 non-null   object
 7   today            5656 non-null   object
 8   car_url          5656 non-null   object
dtypes: object(9)
memory usage: 397.8+ KB

In [139]:
## среднее значение, стандартное отклонение, минимум, 
## медиан и максимум для каждого числового столбца. 
## омогает быстро оценить распределение данных и общие характеристики столбцов.
df.describe ()

,car_brand,car_price,car_location,car_details,ad_date,car_dealer,car_description,today,car_url
count,5656,5656,5656,5656,5656,1663,5047,5656,5656
unique,1586,576,718,4511,87,377,3934,1,4665
top,"Hyundai Solaris, 2014",750 000 ₽,Москва,"4 км, 1.5 MT (106 л.с.), седан, передний, бензин",1 час назад,АвтоЛидер Варшавка,Комплект Зимней (Летней) Резины По Сезону В По...,2021-11-23,https://www.avito.ru//moskva/avtomobili/hyunda...
freq,54,126,916,17,1198,94,56,5656,6

### 1.3 Строки и столбцы : выбор столбцов. 
#### loc, iloc, drop, columns

In [140]:
## давайте теперь исследуем строки. ЛЮБЫЕ строки
## Этот метод использует индексацию на основе меток.
## выбирает значение на пересечении первой строки (индекс 0) и столбца «CARS».

df.loc[0, 'car_details']

'100 181 км, 1.8 CVT (140 л.с.), седан, передний, бензин'

In [141]:
## Метод iloc использует индексацию на основе целых чисел.

df.iloc[0]['car_details']

'100 181 км, 1.8 CVT (140 л.с.), седан, передний, бензин'

In [142]:
## Теперь давайте посмотрим весь столбец «car_details»
df['car_details']

0       100 181 км, 1.8 CVT (140 л.с.), седан, передни...
1       213 000 км, 1.6 MT (105 л.с.), седан, передний...
2       25 600 км, 1.6 MT (106 л.с.), седан, передний,...
3       43 000 км, 1.0 CVT (69 л.с.), хетчбэк, полный,...
4       65 000 км, 1.6 AT (123 л.с.), седан, передний,...
                              ...
5651    174 000 км, 2.0 MT (150 л.с.), внедорожник, по...
5652    180 000 км, 2.8 MT (120 л.с.), фургон, полный,...
5653    183 500 км, 1.6 MT (90 л.с.), хетчбэк, передни...
5654    18 230 км, 1.8 MT (122 л.с.), хетчбэк, передни...
5655    125 000 км, 2.7 MT (135 л.с.), внедорожник, по...
Name: car_details, Length: 5656, dtype: object

In [143]:
df.car_description.head(3)

0    Прoдаю надёжный автомобиль в достойнойном тeхн...
1    По кузову имеется один окрас, остальное все в ...
2    = Самый большой Автомолл! Более 700 автомобиле...
Name: car_description, dtype: object

In [144]:
df.ad_date.head(3)

0    Несколько секунд назад
1    Несколько секунд назад
2    Несколько секунд назад
Name: ad_date, dtype: object

In [ ]:
df.car_url.head(3)

0    https://www.avito.ru//moskva/avtomobili/mitsub...
1    https://www.avito.ru//ekaterinburg/avtomobili/...
2    https://www.avito.ru//ekaterinburg/avtomobili/...
Name: car_url, dtype: object

In [145]:
## Давайте согласимся не соглашаться)) Исходя из того, что я вижу, 
## предлагаю удалить следующие столбцы : ['car_details', 'car_description', 'ad_date', 'car_url']

## Конечно, мы можем удалить любой столбец, который захотим. НО подождите, давайте будем осторожны. 

## Давайте сделаем резервную копию нашего фрейма данных, и вы скоро поймете, почему.
df2 = df.copy()
df3 = df.copy()
df2.head (2)

,car_brand,car_price,car_location,car_details,ad_date,car_dealer,car_description,today,car_url
0,"Mitsubishi Lancer, 2014",650 000 ₽,Москва,"100 181 км, 1.8 CVT (140 л.с.), седан, передни...",Несколько секунд назад,NaN,Прoдаю надёжный автомобиль в достойнойном тeхн...,2021-11-23,https://www.avito.ru//moskva/avtomobili/mitsub...
1,"Mazda 3, 2008",490 000 ₽,"Свердловская область, Екатеринбург","213 000 км, 1.6 MT (105 л.с.), седан, передний...",Несколько секунд назад,NaN,"По кузову имеется один окрас, остальное все в ...",2021-11-23,https://www.avito.ru//ekaterinburg/avtomobili/...

In [146]:
## В Pandas термин «ось» относится к измерению, по которому выполняется операция.
## ось=0: представляет операции вдоль строк (по вертикали).
## ось=1: представляет операции вдоль столбцов (по горизонтали).

## Здесь наши данные df2 НЕ МЕНЯЮТСЯ. Мы просто видим результат сброса функции.
df2.drop (['car_details', 'car_description', 'ad_date', 'car_url'], axis=1)

,car_brand,car_price,car_location,car_dealer,today
0,"Mitsubishi Lancer, 2014",650 000 ₽,Москва,NaN,2021-11-23
1,"Mazda 3, 2008",490 000 ₽,"Свердловская область, Екатеринбург",NaN,2021-11-23
2,"ВАЗ (LADA) Granta, 2020",742 000 ₽,"Свердловская область, Екатеринбург",ИЮЛЬ авто с пробегом,2021-11-23
3,"Toyota Tank, 2018",590 000 ₽,"Приморский край, Владивостокский г.о., Владиво...",NaN,2021-11-23
4,"Kia Rio, 2018",999 000 ₽,"Астраханская область, Астрахань",NaN,2021-11-23
...,...,...,...,...,...
5651,"Hyundai ix35, 2013",880 000 ₽,"Ярославская область, Ярославль",NaN,2021-11-23
5652,"ГАЗ ГАЗель 2705, 2013",497 000 ₽,Москва,NaN,2021-11-23
5653,"Skoda Rapid, 2018",700 000 ₽,"Курская область, Льгов",NaN,2021-11-23
5654,"ВАЗ (LADA) XRAY, 2019",929 000 ₽,"Удмуртская Республика, Ижевск","автосалон ""Столица""",2021-11-23
5655,"УАЗ Patriot, 2016",699 000 ₽,"Самарская область, Самара",NaN,2021-11-23

In [147]:
## drop выполняется выше, и мы увидели, что ненужные столбцы исчезли, но что происходит, когда мы вызываем
## наш фрейм данных df2? ПОЧЕМУ наши предположительно удаленные колонки находятся здесь?

## Помните, что исходный DataFrame df2 остается неизменным, если вы не используете inplace=True 
## или не присваиваете результат обратно исходному DataFrame.
df2.head(2)

,car_brand,car_price,car_location,car_details,ad_date,car_dealer,car_description,today,car_url
0,"Mitsubishi Lancer, 2014",650 000 ₽,Москва,"100 181 км, 1.8 CVT (140 л.с.), седан, передни...",Несколько секунд назад,NaN,Прoдаю надёжный автомобиль в достойнойном тeхн...,2021-11-23,https://www.avito.ru//moskva/avtomobili/mitsub...
1,"Mazda 3, 2008",490 000 ₽,"Свердловская область, Екатеринбург","213 000 км, 1.6 MT (105 л.с.), седан, передний...",Несколько секунд назад,NaN,"По кузову имеется один окрас, остальное все в ...",2021-11-23,https://www.avito.ru//ekaterinburg/avtomobili/...

In [148]:
## Способ 1
## Таким образом, знак = здесь присваивает Полученный DataFrame из операции drop() обратно переменной df2, 
## эффективно обновляя df2, чтобы он содержал измененный DataFrame без указанных столбцов.
df2 = df2.drop (['car_description', 'ad_date', 'car_url', 'car_dealer'], axis=1)
df2.head(2)

,car_brand,car_price,car_location,car_details,today
0,"Mitsubishi Lancer, 2014",650 000 ₽,Москва,"100 181 км, 1.8 CVT (140 л.с.), седан, передни...",2021-11-23
1,"Mazda 3, 2008",490 000 ₽,"Свердловская область, Екатеринбург","213 000 км, 1.6 MT (105 л.с.), седан, передний...",2021-11-23

In [149]:
df3.head(2)

,car_brand,car_price,car_location,car_details,ad_date,car_dealer,car_description,today,car_url
0,"Mitsubishi Lancer, 2014",650 000 ₽,Москва,"100 181 км, 1.8 CVT (140 л.с.), седан, передни...",Несколько секунд назад,NaN,Прoдаю надёжный автомобиль в достойнойном тeхн...,2021-11-23,https://www.avito.ru//moskva/avtomobili/mitsub...
1,"Mazda 3, 2008",490 000 ₽,"Свердловская область, Екатеринбург","213 000 км, 1.6 MT (105 л.с.), седан, передний...",Несколько секунд назад,NaN,"По кузову имеется один окрас, остальное все в ...",2021-11-23,https://www.avito.ru//ekaterinburg/avtomobili/...

In [150]:
## Метод 2 (НЕ РЕКОМЕНДУЕТСЯ!!!) 
df3.drop (['car_description', 'ad_date', 'car_url', 'car_dealer'], axis=1, inplace= True)
df3.head (2)

,car_brand,car_price,car_location,car_details,today
0,"Mitsubishi Lancer, 2014",650 000 ₽,Москва,"100 181 км, 1.8 CVT (140 л.с.), седан, передни...",2021-11-23
1,"Mazda 3, 2008",490 000 ₽,"Свердловская область, Екатеринбург","213 000 км, 1.6 MT (105 л.с.), седан, передний...",2021-11-23

In [151]:
## Прежде чем внести какое-либо постоянное изменение в данные, 
## всегда сравнивайте размер dataframe данных до и после.
df.shape

(5656, 9)

In [153]:
## Хорошо, теперь давайте удалим лишние столбцы из нашей таблицы. 
## Помните, я говорил вам, что не рекомендую метод 2 с (inplace = True)?

## Я сделаю это здесь, но никому не говорите, ладно? ))

df.drop (['car_description', 'ad_date', 'car_url', 'car_dealer'], axis=1, inplace= True)
df.head(2)

,car_brand,car_price,car_location,car_details,today
0,"Mitsubishi Lancer, 2014",650 000 ₽,Москва,"100 181 км, 1.8 CVT (140 л.с.), седан, передни...",2021-11-23
1,"Mazda 3, 2008",490 000 ₽,"Свердловская область, Екатеринбург","213 000 км, 1.6 MT (105 л.с.), седан, передний...",2021-11-23

In [154]:
## Проверьте размер и убедитесь, что столбцов стало меньше.
df.shape

(5656, 5)

In [155]:
df.columns

Index(['car_brand', 'car_price', 'car_location', 'car_details', 'today'], dtype='object')

### 1.4 Очистка данных
#### str split rstrip replace unique

In [156]:
## Мы видим, что производитель автомобиля и год объединены знаком «,» запятой.
## Мы можем  использовать его для разделения этих данных и создания отдельных столбцов для автомобиля и года
df.head (5)

,car_brand,car_price,car_location,car_details,today
0,"Mitsubishi Lancer, 2014",650 000 ₽,Москва,"100 181 км, 1.8 CVT (140 л.с.), седан, передни...",2021-11-23
1,"Mazda 3, 2008",490 000 ₽,"Свердловская область, Екатеринбург","213 000 км, 1.6 MT (105 л.с.), седан, передний...",2021-11-23
2,"ВАЗ (LADA) Granta, 2020",742 000 ₽,"Свердловская область, Екатеринбург","25 600 км, 1.6 MT (106 л.с.), седан, передний,...",2021-11-23
3,"Toyota Tank, 2018",590 000 ₽,"Приморский край, Владивостокский г.о., Владиво...","43 000 км, 1.0 CVT (69 л.с.), хетчбэк, полный,...",2021-11-23
4,"Kia Rio, 2018",999 000 ₽,"Астраханская область, Астрахань","65 000 км, 1.6 AT (123 л.с.), седан, передний,...",2021-11-23

In [157]:
df.car_brand.head (3)

0    Mitsubishi Lancer, 2014
1              Mazda 3, 2008
2    ВАЗ (LADA) Granta, 2020
Name: car_brand, dtype: object

In [ ]:
df.car_brand.tail (3)

5653        Skoda Rapid, 2018
5654    ВАЗ (LADA) XRAY, 2019
5655        УАЗ Patriot, 2016
Name: car_brand, dtype: object

In [ ]:
df.car_brand.sample(n=10)

196                LADA XRAY, 2018
4914              Skoda Yeti, 2013
3355         Volkswagen Golf, 2010
3921         Hyundai Solaris, 2017
1896            Toyota Prius, 2012
4958                 Kia Rio, 2017
4428                Lexus LS, 2007
2319         Volkswagen Polo, 2019
1435            Kia Sportage, 2012
973     Volkswagen Golf Plus, 2010
Name: car_brand, dtype: object

In [158]:
# Чтобы разделить модель автомобиля и данные года, которые разделены запятой, 
## мы можем использовать  Python метод str.split()

## Если expand=True, метод возвращает DataFrame с отдельными столбцами для каждой разделенной части. 
## В нашем случае создаются два новых столбца: модель и год.

df['car_brand'].str.split(',', expand=True)

                      0      1
0     Mitsubishi Lancer   2014
1               Mazda 3   2008
2     ВАЗ (LADA) Granta   2020
3           Toyota Tank   2018
4               Kia Rio   2018
...                 ...    ...
5651       Hyundai ix35   2013
5652    ГАЗ ГАЗель 2705   2013
5653        Skoda Rapid   2018
5654    ВАЗ (LADA) XRAY   2019
5655        УАЗ Patriot   2016

[5656 rows x 2 columns]

In [159]:
df['car_brand'].str.split(',', expand=False)

0       [Mitsubishi Lancer,  2014]
1                 [Mazda 3,  2008]
2       [ВАЗ (LADA) Granta,  2020]
3             [Toyota Tank,  2018]
4                 [Kia Rio,  2018]
                   ...
5651         [Hyundai ix35,  2013]
5652      [ГАЗ ГАЗель 2705,  2013]
5653          [Skoda Rapid,  2018]
5654      [ВАЗ (LADA) XRAY,  2019]
5655          [УАЗ Patriot,  2016]
Name: car_brand, Length: 5656, dtype: object

In [160]:
## Какая разница? Давайте вспомним наш встроенный в Python метод type() и ответим на этот вопрос.

## DataFrame pandas — это двумерная помеченная структура данных со столбцами потенциально разных типов, 

## Серия Pandas (series) — это одномерный помеченный массив, способный хранить данные любого типа.

## !!! Подробности см. в файле py_basics.py Pandas Series.

type (df['car_brand'].str.split(',', expand=True)) , type (df['car_brand'].str.split(',', expand=False))

(pandas.core.frame.DataFrame, pandas.core.series.Series)

In [161]:
## Теперь, когда я знаю, что моя операция str.split() создает два столбца, 
## я могу придумать имена столбцов, которые мне удобны, НО ВАЖНО ТОЛЬКО ДВА, 
## и назначить их моему фрейму данных, эффективно изменяя форму моего фрейма данных.

df[['model', 'year']] = df['car_brand'].str.split(',', expand=True)
df.head(2)

,car_brand,car_price,car_location,car_details,today,model,year
0,"Mitsubishi Lancer, 2014",650 000 ₽,Москва,"100 181 км, 1.8 CVT (140 л.с.), седан, передни...",2021-11-23,Mitsubishi Lancer,2014
1,"Mazda 3, 2008",490 000 ₽,"Свердловская область, Екатеринбург","213 000 км, 1.6 MT (105 л.с.), седан, передний...",2021-11-23,Mazda 3,2008

In [162]:
## Сравните наш фрейм данных до и после этой операции.
df.shape

(5656, 7)

In [163]:
## Далее идет столбец цен на автомобили: в нем есть ненужный символ, 
## который будет мешать нашим будущим статистическим операциям с этим столбцом.

## Давайте удалим этот символ

df.car_price.sample(n=10, replace=False)

3576    700 000 ₽
5183    630 000 ₽
2650    650 000 ₽
1575    756 000 ₽
619     750 000 ₽
5425    580 000 ₽
5554    499 000 ₽
2123    900 000 ₽
5243    685 000 ₽
588     680 000 ₽
Name: car_price, dtype: object

In [164]:
## Но давайте рассмотрим  новую для нас функцию: str.contains(). 
## Мы хотим узнать, содержит ли  столбец car_price "₽" . В любом месте

## Мы видим True (или False, если символ не существует). 

df.car_price.str.contains('₽')

0       True
1       True
2       True
3       True
4       True
        ...
5651    True
5652    True
5653    True
5654    True
5655    True
Name: car_price, Length: 5656, dtype: bool

In [165]:
type (df.car_price.str.contains('₽'))

pandas.core.series.Series

In [ ]:
## Когда вы используете sum() в этой серии, он вычисляет сумму логических значений. 
## В Python True рассматривается как 1, а False — как 0 при суммировании логических значений.
sum(df.car_price.str.contains('₽'))

5656

In [166]:
## У нас есть разные методы, как удалить символ '₽'

df['car_price'].str.replace('₽', '').head(5)

0    650 000
1    490 000
2    742 000
3    590 000
4    999 000
Name: car_price, dtype: object

In [167]:
## Метод регулярного выражения *regex*, который не использует промежуточный метод преобразования str
df['car_price'].replace(r'₽', '', regex=True).head(5)

0    650 000
1    490 000
2    742 000
3    590 000
4    999 000
Name: car_price, dtype: object

In [168]:
## Мы можем выполнить операцию удаления символа прямо на столбце 'car_price' и переназначить его. 
## # df['car_price'] = df['car_price'].str.replace('₽', '')
## Однако делать это не рекомендуется. 
## Вместо этого мы создадим новый столбец для нашего фрейма данных с уже чистыми данными о ценах.

df['price'] = df['car_price'].str.replace('₽', '')
df.head(3)

,car_brand,car_price,car_location,car_details,today,model,year,price
0,"Mitsubishi Lancer, 2014",650 000 ₽,Москва,"100 181 км, 1.8 CVT (140 л.с.), седан, передни...",2021-11-23,Mitsubishi Lancer,2014,650 000
1,"Mazda 3, 2008",490 000 ₽,"Свердловская область, Екатеринбург","213 000 км, 1.6 MT (105 л.с.), седан, передний...",2021-11-23,Mazda 3,2008,490 000
2,"ВАЗ (LADA) Granta, 2020",742 000 ₽,"Свердловская область, Екатеринбург","25 600 км, 1.6 MT (106 л.с.), седан, передний,...",2021-11-23,ВАЗ (LADA) Granta,2020,742 000

In [169]:
## Далее у нас есть столбец car_details, который, как вы заметили, также разделен запятыми. 
## Вы уже знаете, как использовать это свойство для разделения данных и создания новых столбцов.

df.iloc[0]['car_details']

'100 181 км, 1.8 CVT (140 л.с.), седан, передний, бензин'

In [170]:
# Сначала мы разделим данные с помощью expand=True и посмотрим количество  созданных столбцов.
df['car_details'].str.split(',', expand=True).head(3)

            0                    1       2          3        4
0  100 181 км   1.8 CVT (140 л.с.)   седан   передний   бензин
1  213 000 км    1.6 MT (105 л.с.)   седан   передний   бензин
2   25 600 км    1.6 MT (106 л.с.)   седан   передний   бензин

In [171]:
## Обратите внимание, что наш фрейм данных df не меняется после этой операции,
##  поскольку здесь нет назначения столбцов.
df.sample(n=5)

,car_brand,car_price,car_location,car_details,today,model,year,price
489,"LADA Largus, 2018",625 000 ₽,"Саратовская область, Пугачёвский р-н, Пугачёв","160 000 км, 1.6 MT (106 л.с.), универсал, пере...",2021-11-23,LADA Largus,2018,625 000
445,"Ford Mondeo, 2011",760 000 ₽,"Тульская область, Тула","94 000 км, 2.0 AMT (200 л.с.), седан, передний...",2021-11-23,Ford Mondeo,2011,760 000
1938,"BMW 3 серия, 2008",700 000 ₽,"Московская область, Клин","141 000 км, 2.5 AT (218 л.с.), седан, задний, ...",2021-11-23,BMW 3 серия,2008,700 000
972,"LADA Granta, 2017",490 000 ₽,"Курская область, Курск","110 765 км, 1.6 MT (106 л.с.), седан, передний...",2021-11-23,LADA Granta,2017,490 000
3875,"LADA Granta, 2019",654 000 ₽,"Ростовская область, Ростов-на-Дону","30 000 км, 1.6 MT (106 л.с.), хетчбэк, передни...",2021-11-23,LADA Granta,2019,654 000

In [172]:
df[['mileage', 'vol_box_hp', 'body', 'drive', 'fuel']] = df['car_details'].str.split(',', expand=True)
df.head(2)

,car_brand,car_price,car_location,car_details,today,model,year,price,mileage,vol_box_hp,body,drive,fuel
0,"Mitsubishi Lancer, 2014",650 000 ₽,Москва,"100 181 км, 1.8 CVT (140 л.с.), седан, передни...",2021-11-23,Mitsubishi Lancer,2014,650 000,100 181 км,1.8 CVT (140 л.с.),седан,передний,бензин
1,"Mazda 3, 2008",490 000 ₽,"Свердловская область, Екатеринбург","213 000 км, 1.6 MT (105 л.с.), седан, передний...",2021-11-23,Mazda 3,2008,490 000,213 000 км,1.6 MT (105 л.с.),седан,передний,бензин

In [173]:
df.columns

Index(['car_brand', 'car_price', 'car_location', 'car_details', 'today',
       'model', 'year', 'price', 'mileage', 'vol_box_hp', 'body', 'drive',
       'fuel'],
      dtype='object')

In [174]:
## В нашей колонке «vol_box_hp» содержится информация об объеме двигателя, 
## коробке передач и мощности. Нам нужно разделить их на разные столбцы.
df.vol_box_hp.sample(n=10)

4522     1.8 MT (160 л.с.)
2188     1.6 AT (120 л.с.)
3332     4.2 AT (350 л.с.)
3219      1.2 MT (70 л.с.)
4473     1.6 MT (105 л.с.)
3062     1.6 AT (129 л.с.)
4702     1.6 MT (105 л.с.)
3858     1.6 MT (106 л.с.)
2614      1.6 MT (87 л.с.)
606      2.4 MT (169 л.с.)
Name: vol_box_hp, dtype: object

In [175]:
## Этот разделитель эффективно разбивает строку там, где она встречает пробел, за которым следует открывающая скобка.
df[['vol_box', 'hp']] = df['vol_box_hp'].str.split(' \(', expand=True)

## Убираем закрывающую скобку из столбца «лошадиные силы»
## Метод rstrip() в Python используется для удаления символов из конца (правой части) строки.
df['hp'] = df['hp'].str.rstrip(')')

In [176]:
df.vol_box.sample(n = 5)

5644     1.6 MT
3174     2.0 MT
2610     1.9 MT
3922     1.6 MT
2004     1.7 MT
Name: vol_box, dtype: object

In [ ]:
df.hp.sample(n = 5)

3898    120 л.с.
3754    106 л.с.
5532     87 л.с.
2631    123 л.с.
2667    115 л.с.
Name: hp, dtype: object

In [177]:
## Далее мы удаляем ' л.с.'
df['hp'] = df['hp'].str.replace(' л.с.', '')
df.hp.sample(n = 5)

5130    103
4244    180
2879    110
3931    123
1271    123
Name: hp, dtype: object

In [178]:
df.vol_box.sample(n = 5)

2714     1.6 AT
2654     1.4 AT
3094     1.6 MT
5048     1.6 AT
59       1.6 MT
Name: vol_box, dtype: object

In [179]:
## Нам также необходимо иметь отдельные столбцы для объема двигателя и коробки передач.

## Давайте проделаем уже знакомую операцию str.split(). 
## И похоже, у нас возникла проблема: вместо ожидаемых двух столбцов получилось 3. 
## Почему? Давайте изучим проблему
df['vol_box'].str.split(' ', expand=True).head(5)

  0    1    2
0    1.8  CVT
1    1.6   MT
2    1.6   MT
3    1.0  CVT
4    1.6   AT

In [180]:
frame = df['vol_box'].str.split(' ', expand=True)
frame.head(3)

  0    1    2
0    1.8  CVT
1    1.6   MT
2    1.6   MT

In [181]:
## быстрый осмотр показывает, что ничего нет. Но почему str.split() создал 3 столбца? 
## Он не может создать столбец без данных
frame.iloc[:, 0].sample (n=10)

3922
2316
3445
1238
1963
5552
806
1655
5535
5416
Name: 0, dtype: object

In [182]:
## Похоже, что наша функция Split() использовала пустое пространство как еще один символ 
## и создала столбец, основанный только на «пустом» пространстве.

frame.iloc[:, 0].unique()

array([''], dtype=object)

In [ ]:
frame.iloc[:, 2].unique()

array(['CVT', 'MT', 'AT', 'AMT', None], dtype=object)

In [183]:
df[['delete_later', 'vol', 'box']] =  df['vol_box'].str.split(' ', expand=True)

In [184]:
df.columns

Index(['car_brand', 'car_price', 'car_location', 'car_details', 'today',
       'model', 'year', 'price', 'mileage', 'vol_box_hp', 'body', 'drive',
       'fuel', 'vol_box', 'hp', 'delete_later', 'vol', 'box'],
      dtype='object')

In [185]:
df.box.sample(n=10)

4668     MT
2533     MT
4113    CVT
4669     MT
2126    AMT
4546    CVT
941      AT
2963     MT
4362    CVT
894      MT
Name: box, dtype: object

In [186]:
df.vol.sample(n=10)

459     1.6
4273    1.7
1816    1.6
5392    1.2
4539    1.6
1687    1.6
225     2.0
1120    2.0
4686    1.6
1242    1.6
Name: vol, dtype: object

In [ ]:
df.mileage.sample(n=5)

2385    141 000 км
3437    105 000 км
4154    114 000 км
1196    170 000 км
833      67 473 км
Name: mileage, dtype: object

In [187]:
## В столбце mileage указан символ км, который будет препятствовать статистическим операциям. 
## давайте создадим новый столбец, без км
df['total_km'] = df['mileage'].str.replace(' км', '')

In [ ]:
df.total_km.sample(n=10)

1959    112 500
1297    117 000
5580     85 000
1721          1
5245    171 200
841     124 500
2842    194 500
610     122 000
132     149 548
4068    200 000
Name: total_km, dtype: object

In [188]:
df.total_km.sample (n=10)

308      92 000
5075    237 000
716     337 758
5492     11 459
4151     60 158
3673    198 000
3169    165 000
3558    115 000
556     178 000
3757    186 566
Name: total_km, dtype: object

In [196]:
location =df['car_location'].str.split(',',  expand=True)

In [197]:
location.iloc[:, 4].unique()

array([None,
       ' садоводческое некоммерческое товарищество Толстопальцево-4'],
      dtype=object)

In [198]:
df['location'] = df['car_location'].str.split(',',  expand=True)[0]

### 1.5 Типы данных: Преобразование 
### isnull, sum, dtypes, astype, map, lambda

In [199]:
df.head(2)

,car_brand,car_price,car_location,car_details,today,model,year,price,mileage,vol_box_hp,body,drive,fuel,vol_box,hp,delete_later,vol,box,total_km,location
0,"Mitsubishi Lancer, 2014",650 000 ₽,Москва,"100 181 км, 1.8 CVT (140 л.с.), седан, передни...",2021-11-23,Mitsubishi Lancer,2014,650 000,100 181 км,1.8 CVT (140 л.с.),седан,передний,бензин,1.8 CVT,140,,1.8,CVT,100 181,Москва
1,"Mazda 3, 2008",490 000 ₽,"Свердловская область, Екатеринбург","213 000 км, 1.6 MT (105 л.с.), седан, передний...",2021-11-23,Mazda 3,2008,490 000,213 000 км,1.6 MT (105 л.с.),седан,передний,бензин,1.6 MT,105,,1.6,MT,213 000,Свердловская область

In [200]:
df.columns

Index(['car_brand', 'car_price', 'car_location', 'car_details', 'today',
       'model', 'year', 'price', 'mileage', 'vol_box_hp', 'body', 'drive',
       'fuel', 'vol_box', 'hp', 'delete_later', 'vol', 'box', 'total_km',
       'location'],
      dtype='object')

In [201]:
df[['model','year', 'price','total_km', 'hp', 'body', 'drive', 'fuel', 'location' ]]

,model,year,price,total_km,hp,body,drive,fuel,location
0,Mitsubishi Lancer,2014,650 000,100 181,140,седан,передний,бензин,Москва
1,Mazda 3,2008,490 000,213 000,105,седан,передний,бензин,Свердловская область
2,ВАЗ (LADA) Granta,2020,742 000,25 600,106,седан,передний,бензин,Свердловская область
3,Toyota Tank,2018,590 000,43 000,69,хетчбэк,полный,бензин,Приморский край
4,Kia Rio,2018,999 000,65 000,123,седан,передний,бензин,Астраханская область
...,...,...,...,...,...,...,...,...,...
5651,Hyundai ix35,2013,880 000,174 000,150,внедорожник,полный,бензин,Ярославская область
5652,ГАЗ ГАЗель 2705,2013,497 000,180 000,120,фургон,полный,дизель,Москва
5653,Skoda Rapid,2018,700 000,183 500,90,хетчбэк,передний,бензин,Курская область
5654,ВАЗ (LADA) XRAY,2019,929 000,18 230,122,хетчбэк,передний,бензин,Удмуртская Республика
5655,УАЗ Patriot,2016,699 000,125 000,135,внедорожник,полный,бензин,Самарская область

In [202]:
##!! Вопрос. Как вы думаете, что здесь произойдет? 
## Будет ли у меня короткая или длинная версия со всеми столбцами?
df.head(2)

,car_brand,car_price,car_location,car_details,today,model,year,price,mileage,vol_box_hp,body,drive,fuel,vol_box,hp,delete_later,vol,box,total_km,location
0,"Mitsubishi Lancer, 2014",650 000 ₽,Москва,"100 181 км, 1.8 CVT (140 л.с.), седан, передни...",2021-11-23,Mitsubishi Lancer,2014,650 000,100 181 км,1.8 CVT (140 л.с.),седан,передний,бензин,1.8 CVT,140,,1.8,CVT,100 181,Москва
1,"Mazda 3, 2008",490 000 ₽,"Свердловская область, Екатеринбург","213 000 км, 1.6 MT (105 л.с.), седан, передний...",2021-11-23,Mazda 3,2008,490 000,213 000 км,1.6 MT (105 л.с.),седан,передний,бензин,1.6 MT,105,,1.6,MT,213 000,Свердловская область

In [203]:
df_final = df[['model','year', 'price','total_km', 'hp', 'body', 'drive', 'fuel', 'location' ]]
df_final.head(2)

,model,year,price,total_km,hp,body,drive,fuel,location
0,Mitsubishi Lancer,2014,650 000,100 181,140,седан,передний,бензин,Москва
1,Mazda 3,2008,490 000,213 000,105,седан,передний,бензин,Свердловская область

In [204]:
## Здесь мы проверяем, что не потеряли ни одной строки.
df.shape, df_final.shape

((5656, 20), (5656, 9))

In [205]:
df_final.info ()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5656 entries, 0 to 5655
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   model     5656 non-null   object
 1   year      5656 non-null   object
 2   price     5656 non-null   object
 3   total_km  5656 non-null   object
 4   hp        5656 non-null   object
 5   body      5656 non-null   object
 6   drive     5656 non-null   object
 7   fuel      5656 non-null   object
 8   location  5656 non-null   object
dtypes: object(9)
memory usage: 397.8+ KB

In [206]:
## Давайте убедимся, что у нас действительно нет нулевых значений.
## Это почти идеальный случай. Обычно у вас будет нулевое значение в ваших данных, 
## особенно когда они не обработаны. Здесь у нас нет нулевых значений, 
## Потому что наше программное обеспечение для автоматического сбора данных 
## игнорировало нулевые или пустые строки.

df_final.isnull().sum()

model       0
year        0
price       0
total_km    0
hp          0
body        0
drive       0
fuel        0
location    0
dtype: int64

In [207]:
df_final.dtypes

model       object
year        object
price       object
total_km    object
hp          object
body        object
drive       object
fuel        object
location    object
dtype: object

In [208]:
## Давайте попробуем одну очень простую операцию со столбцом: возьмем среднее значение по всему столбцу.
## Результат будет.  TypeError: Could not convert string

## Можете догадаться, почему?

## Подсказка находится внутри более длинного сообщения об ошибке Traceback.
##  TypeError(f"Could not convert string '{x}' to numeric")

# df_final.total_km.mean()

In [209]:
df_final.total_km.sample (n = 10)

5277    165 000
5457     89 000
2968    116 467
3084    100 000
2974     85 206
4046     53 444
4963    420 000
2479    174 000
613      37 340
3717    109 000
Name: total_km, dtype: object

In [211]:
## Действительно, Python обычно выдает сообщения об ошибках, 
## которые помогают нам подумать, в каком направлении мы можем двигаться.

## Давайте воспользуемся этой подсказкой для преобразования типа данных нашего столбца.
## Сначала мы попробуем pd.to_numeric функцию, так как согласно нашей подсказке это первое, что приходит на ум.

## На этот раз мы получаем эту ValueError: Unable to parse string "100 181" at position 0
## Не очень понятное сообщение, что на этот раз делать ))

# df_final['total_km'].apply(pd.to_numeric)

In [212]:
## Заметим, что в 100 181 есть пробел
## давайте удалим его, а затем применим результаты к столбцу, преобразуя их в тип float.

## astype(float) использовалось в качестве меры предосторожности, 
## поскольку преобразование строки типа «100 181» непосредственно в целое число 
## могло вызвать ошибку из-за присутствия нечисловых символов (в данном случае пробела). 
## Преобразуя в число с плавающей запятой, 
## вы допускаете возможность присутствия в данных нецелочисленных значений без возникновения ошибок.


df_final['total_km'].str.replace(' ', '').astype(float)

0       100181.0
1       213000.0
2        25600.0
3        43000.0
4        65000.0
          ...
5651    174000.0
5652    180000.0
5653    183500.0
5654     18230.0
5655    125000.0
Name: total_km, Length: 5656, dtype: float64

In [213]:
df_final.dtypes

model       object
year        object
price       object
total_km    object
hp          object
body        object
drive       object
fuel        object
location    object
dtype: object

In [214]:
## Мы можем использовать метод str() в сочетании с replace() для выполнения 
## операций над отдельными столбцами, но не над несколькими столбцами одновременно.

## потому что метод str может быть применительно к серией pandas, которая, 
## как мы помним, представляет собой одномерный массив. 
## Но этот метод нельзя применить к двумерному фрейму данных в пандах.


df_final['total_km'].str.replace(' ', '').astype(float).head(2)

0    100181.0
1    213000.0
Name: total_km, dtype: float64

In [215]:
## Вместо этого мы будем использовать комбинацию map и лямбда-функций, 
## чтобы иметь возможность изменять несколько столбцов одновременно. 

## Подробнее о map  и  lambda функциях см. в нашем py_bsacis файле.
df_final[['price','total_km', 'hp']].map(lambda x: float(x.replace(' ', '')))

         price  total_km     hp
0     650000.0  100181.0  140.0
1     490000.0  213000.0  105.0
2     742000.0   25600.0  106.0
3     590000.0   43000.0   69.0
4     999000.0   65000.0  123.0
...        ...       ...    ...
5651  880000.0  174000.0  150.0
5652  497000.0  180000.0  120.0
5653  700000.0  183500.0   90.0
5654  929000.0   18230.0  122.0
5655  699000.0  125000.0  135.0

[5656 rows x 3 columns]

In [216]:


df_final[['price','total_km', 'hp']] = df_final[['price','total_km', 'hp']].map(lambda x: float(x.replace(' ', '')))

/tmp/ipykernel_19828/730509546.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_final[['price','total_km', 'hp']] = df_final[['price','total_km', 'hp']].map(lambda x: float(x.replace(' ', '')))

In [217]:
df_final.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5656 entries, 0 to 5655
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   model     5656 non-null   object
 1   year      5656 non-null   object
 2   price     5656 non-null   float64
 3   total_km  5656 non-null   float64
 4   hp        5656 non-null   float64
 5   body      5656 non-null   object
 6   drive     5656 non-null   object
 7   fuel      5656 non-null   object
 8   location  5656 non-null   object
dtypes: float64(3), object(6)
memory usage: 397.8+ KB

In [218]:
## Наконец, давайте изменим наш столбец year.
## Один из распространенных вариантов — преобразовать его в целочисленный тип, 
## предполагая, что столбец year содержит целые годы. 

df_final['year'] = df_final['year'].str.replace(' ', '').astype(int)

/tmp/ipykernel_19828/3499422409.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_final['year'] = df_final['year'].str.replace(' ', '').astype(int)

In [219]:
df_final.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5656 entries, 0 to 5655
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   model     5656 non-null   object
 1   year      5656 non-null   int64
 2   price     5656 non-null   float64
 3   total_km  5656 non-null   float64
 4   hp        5656 non-null   float64
 5   body      5656 non-null   object
 6   drive     5656 non-null   object
 7   fuel      5656 non-null   object
 8   location  5656 non-null   object
dtypes: float64(3), int64(1), object(5)
memory usage: 397.8+ KB

In [220]:
df_final.describe()

              year           price       total_km           hp
count  5656.000000     5656.000000    5656.000000  5656.000000
mean   2012.216407   696539.233911  137306.148161   132.765205
std       5.132224   155618.216508   84263.716593    48.952725
min    1940.000000   450000.000000       1.000000    22.000000
25%    2009.000000   565000.000000   82000.000000   106.000000
50%    2012.000000   685000.000000  130506.000000   122.000000
75%    2016.000000   819000.000000  179000.000000   147.000000
max    2021.000000  1000000.000000  960000.000000   510.000000

In [221]:
df_final.head(5)

,model,year,price,total_km,hp,body,drive,fuel,location
0,Mitsubishi Lancer,2014,650000.0,100181.0,140.0,седан,передний,бензин,Москва
1,Mazda 3,2008,490000.0,213000.0,105.0,седан,передний,бензин,Свердловская область
2,ВАЗ (LADA) Granta,2020,742000.0,25600.0,106.0,седан,передний,бензин,Свердловская область
3,Toyota Tank,2018,590000.0,43000.0,69.0,хетчбэк,полный,бензин,Приморский край
4,Kia Rio,2018,999000.0,65000.0,123.0,седан,передний,бензин,Астраханская область

In [222]:
# Save as CSV
df_final.to_csv('data_clean/cleaned_final_cars_data.csv', index=False)

# Save DataFrame object using pickle (optional)
# df.to_pickle('data/cleaned_final_data.csv')